<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and database maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [43]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [2]:
#c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

In [3]:
#c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [4]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [5]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
# 
c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

Select all rows from houses

In [6]:
# A
query = 'Select * from houses'
c.execute(query)
c.fetchall()
#pd.DataFrame(c.fetchall())

[(1, 2390, 4, 34, 319000),
 (2, 1870, 3, 14, 289000),
 (3, 1505, 3, 90, 269000),
 (4, 2104, 3, 70, 399900),
 (5, 1600, 3, 28, 329900),
 (6, 2400, 3, 44, 369000),
 (7, 1416, 2, 49, 232000),
 (8, 3000, 4, 75, 539900),
 (9, 1985, 4, 61, 299900),
 (10, 1534, 3, 12, 314900),
 (11, 1427, 3, 57, 198999),
 (12, 1380, 3, 14, 212000),
 (13, 1494, 3, 15, 242500),
 (14, 1940, 4, 7, 239999),
 (15, 2000, 3, 27, 347000),
 (16, 1890, 3, 45, 329999),
 (17, 4478, 5, 49, 699900),
 (18, 1268, 3, 58, 259900),
 (19, 2300, 4, 77, 449900),
 (20, 1320, 2, 62, 299900),
 (21, 1236, 3, 78, 199900),
 (22, 2609, 4, 5, 499998),
 (23, 3031, 4, 21, 599000),
 (24, 1767, 3, 44, 252900),
 (25, 1888, 2, 79, 255000),
 (26, 1604, 3, 13, 242900),
 (27, 1962, 4, 53, 259900),
 (28, 3890, 3, 36, 573900),
 (29, 1100, 3, 60, 249900),
 (30, 1458, 3, 29, 464500),
 (31, 2526, 3, 13, 469000),
 (32, 2200, 3, 28, 475000),
 (33, 2637, 3, 25, 299900),
 (34, 1839, 2, 40, 349900),
 (35, 1000, 1, 5, 169900),
 (36, 2040, 4, 75, 314900),
 (37, 3137, 3, 67, 579900),
 (38, 1811, 4, 24, 285900),
 (39, 1437, 3, 50, 249900),
 (40, 1239, 3, 22, 229900),
 (41, 2132, 4, 28, 345000),
 (42, 4215, 4, 66, 549000),
 (43, 2162, 4, 43, 287000),
 (44, 1664, 2, 40, 368500),
 (45, 2238, 3, 37, 329900),
 (46, 2567, 4, 57, 314000),
 (47, 1200, 3, 76, 299000),
 (48, 852, 2, 70, 179900),
 (49, 1852, 4, 64, 299900),
 (50, 1203, 3, 11, 239500),
 (51, 2104, 3, 70, 399900),
 (54, 1416, 2, 49, 232000),
 (55, 3000, 4, 75, 539900),
 (56, 1985, 4, 61, 299900),
 (57, 1534, 3, 12, 314900),
 (58, 1427, 3, 57, 198999),
 (59, 1380, 3, 14, 212000),
 (60, 1494, 3, 15, 242500),
 (61, 1940, 4, 7, 239999),
 (62, 2000, 3, 27, 347000),
 (63, 1890, 3, 45, 329999),
 (64, 4478, 5, 49, 699900),
 (65, 1268, 3, 58, 259900),
 (66, 2300, 4, 77, 449900),
 (67, 1320, 2, 62, 299900),
 (68, 1236, 3, 78, 199900),
 (69, 2609, 4, 5, 499998),
 (70, 3031, 4, 21, 599000),
 (71, 1767, 3, 44, 252900),
 (72, 1888, 2, 79, 255000),
 (73, 1604, 3, 13, 242900),
 (74, 1962, 4, 53, 259900),
 (75, 3890, 3, 36, 573900),
 (76, 1100, 3, 60, 249900),
 (77, 1458, 3, 29, 464500),
 (78, 2526, 3, 13, 469000),
 (79, 2200, 3, 28, 475000),
 (80, 2637, 3, 25, 299900),
 (81, 1839, 2, 40, 349900),
 (82, 1000, 1, 5, 169900),
 (83, 2040, 4, 75, 314900),
 (84, 3137, 3, 67, 579900),
 (85, 1811, 4, 24, 285900),
 (86, 1437, 3, 50, 249900),
 (87, 1239, 3, 22, 229900),
 (88, 2132, 4, 28, 345000),
 (89, 4215, 4, 66, 549000),
 (90, 2162, 4, 43, 287000),
 (91, 1664, 2, 40, 368500),
 (92, 2238, 3, 37, 329900),
 (93, 2567, 4, 57, 314000),
 (94, 1200, 3, 76, 299000),
 (95, 852, 2, 70, 179900),
 (96, 1852, 4, 64, 299900),
 (97, 1203, 3, 11, 239500),
 (98, 1200, 3, 15, 250000),
 (99, 1200, 3, 15, 250000),
 (100, 4000, 5, 22, 619000),
 (101, 2390, 4, 34, 319000),
 (102, 1870, 3, 14, 289000),
 (103, 1505, 3, 90, 269000),
 (104, 2104, 3, 70, 399900),
 (105, 1600, 3, 28, 329900),
 (106, 2400, 3, 44, 369000),
 (107, 1416, 2, 49, 232000),
 (108, 3000, 4, 75, 539900),
 (109, 1985, 4, 61, 299900),
 (110, 1534, 3, 12, 314900),
 (111, 1427, 3, 57, 198999),
 (112, 1380, 3, 14, 212000),
 (113, 1494, 3, 15, 242500),
 (114, 1940, 4, 7, 239999),
 (115, 2000, 3, 27, 347000),
 (116, 1890, 3, 45, 329999),
 (117, 4478, 5, 49, 699900),
 (118, 1268, 3, 58, 259900),
 (119, 2300, 4, 77, 449900),
 (120, 1320, 2, 62, 299900),
 (121, 1236, 3, 78, 199900),
 (122, 2609, 4, 5, 499998),
 (123, 3031, 4, 21, 599000),
 (124, 1767, 3, 44, 252900),
 (125, 1888, 2, 79, 255000),
 (126, 1604, 3, 13, 242900),
 (127, 1962, 4, 53, 259900),
 (128, 3890, 3, 36, 573900),
 (129, 1100, 3, 60, 249900),
 (130, 1458, 3, 29, 464500),
 (131, 2526, 3, 13, 469000),
 (132, 2200, 3, 28, 475000),
 (133, 2637, 3, 25, 299900),
 (134, 1839, 2, 40, 349900),
 (135, 1000, 1, 5, 169900),
 (136, 2040, 4, 75, 314900),
 (137, 3137, 3, 67, 579900),
 (138, 1811, 4, 24, 285900),
 (139, 1437, 3, 50, 249900),
 (140, 1239, 3, 22, 229900),
 (141, 2132, 4, 28, 345000),
 (142, 4215, 4, 66, 549000),
 (143, 2162, 4, 43, 287000),
 (144, 1664, 2, 40, 368500),
 (145, 2238, 3, 37, 329900),
 (146, 2567, 4, 57, 314000),
 (147, 1200, 3, 76, 299000),
 (148, 852, 2, 70, 179900),
 (149, 1852, 4, 64, 299900),
 (150, 1203, 3, 11, 239500),
 (151, 1200, 3, 15, 250000),
 (152, 4000, 5, 22, 619000),
 (153, 2390, 4, 34, 319000),
 (154, 1870, 3, 14, 289000),
 (155, 1505, 3, 90, 269000),
 (156, 2104, 3, 70, 399900),
 (157, 1600, 3, 28, 329900),
 (158, 2400, 3, 44, 369000),
 (159, 1416, 2, 49, 232000),
 (160, 3000, 4, 75, 539900),
 (161, 1985, 4, 61, 299900),
 (162, 1534, 3, 12, 314900),
 (163, 1427, 3, 57, 198999),
 (164, 1380, 3, 14, 212000),
 (165, 1494, 3, 15, 242500),
 (166, 1940, 4, 7, 239999),
 (167, 2000, 3, 27, 347000),
 (168, 1890, 3, 45, 329999),
 (169, 4478, 5, 49, 699900),
 (170, 1268, 3, 58, 259900),
 (171, 2300, 4, 77, 449900),
 (172, 1320, 2, 62, 299900),
 (173, 1236, 3, 78, 199900),
 (174, 2609, 4, 5, 499998),
 (175, 3031, 4, 21, 599000),
 (176, 1767, 3, 44, 252900),
 (177, 1888, 2, 79, 255000),
 (178, 1604, 3, 13, 242900),
 (179, 1962, 4, 53, 259900),
 (180, 3890, 3, 36, 573900),
 (181, 1100, 3, 60, 249900),
 (182, 1458, 3, 29, 464500),
 (183, 2526, 3, 13, 469000),
 (184, 2200, 3, 28, 475000),
 (185, 2637, 3, 25, 299900),
 (186, 1839, 2, 40, 349900),
 (187, 1000, 1, 5, 169900),
 (188, 2040, 4, 75, 314900),
 (189, 3137, 3, 67, 579900),
 (190, 1811, 4, 24, 285900),
 (191, 1437, 3, 50, 249900),
 (192, 1239, 3, 22, 229900),
 (193, 2132, 4, 28, 345000),
 (194, 4215, 4, 66, 549000),
 (195, 2162, 4, 43, 287000),
 (196, 1664, 2, 40, 368500),
 (197, 2238, 3, 37, 329900),
 (198, 2567, 4, 57, 314000),
 (199, 1200, 3, 76, 299000),
 (200, 852, 2, 70, 179900),
 (201, 1852, 4, 64, 299900),
 (202, 1203, 3, 11, 239500),
 (203, 1200, 3, 15, 250000),
 (204, 4000, 5, 22, 619000),
 (205, 2390, 4, 34, 319000),
 (206, 1870, 3, 14, 289000),
 (207, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [7]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:

data = genfromtxt('..\..\DATA\housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [8]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [9]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [10]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [11]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [12]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [13]:
# ANSWER
c.execute("SELECT * FROM houses WHERE bdrms is 4;").fetchall()

[(1, 2390, 4, 34, 319000),
 (8, 3000, 4, 75, 539900),
 (9, 1985, 4, 61, 299900),
 (14, 1940, 4, 7, 239999),
 (19, 2300, 4, 77, 449900),
 (22, 2609, 4, 5, 499998),
 (23, 3031, 4, 21, 599000),
 (27, 1962, 4, 53, 259900),
 (36, 2040, 4, 75, 314900),
 (38, 1811, 4, 24, 285900),
 (41, 2132, 4, 28, 345000),
 (42, 4215, 4, 66, 549000),
 (43, 2162, 4, 43, 287000),
 (46, 2567, 4, 57, 314000),
 (49, 1852, 4, 64, 299900),
 (55, 3000, 4, 75, 539900),
 (56, 1985, 4, 61, 299900),
 (61, 1940, 4, 7, 239999),
 (66, 2300, 4, 77, 449900),
 (69, 2609, 4, 5, 499998),
 (70, 3031, 4, 21, 599000),
 (74, 1962, 4, 53, 259900),
 (83, 2040, 4, 75, 314900),
 (85, 1811, 4, 24, 285900),
 (88, 2132, 4, 28, 345000),
 (89, 4215, 4, 66, 549000),
 (90, 2162, 4, 43, 287000),
 (93, 2567, 4, 57, 314000),
 (96, 1852, 4, 64, 299900),
 (101, 2390, 4, 34, 319000),
 (108, 3000, 4, 75, 539900),
 (109, 1985, 4, 61, 299900),
 (114, 1940, 4, 7, 239999),
 (119, 2300, 4, 77, 449900),
 (122, 2609, 4, 5, 499998),
 (123, 3031, 4, 21, 599000),
 (127, 1962, 4, 53, 259900),
 (136, 2040, 4, 75, 314900),
 (138, 1811, 4, 24, 285900),
 (141, 2132, 4, 28, 345000),
 (142, 4215, 4, 66, 549000),
 (143, 2162, 4, 43, 287000),
 (146, 2567, 4, 57, 314000),
 (149, 1852, 4, 64, 299900),
 (153, 2390, 4, 34, 319000),
 (160, 3000, 4, 75, 539900),
 (161, 1985, 4, 61, 299900),
 (166, 1940, 4, 7, 239999),
 (171, 2300, 4, 77, 449900),
 (174, 2609, 4, 5, 499998),
 (175, 3031, 4, 21, 599000),
 (179, 1962, 4, 53, 259900),
 (188, 2040, 4, 75, 314900),
 (190, 1811, 4, 24, 285900),
 (193, 2132, 4, 28, 345000),
 (194, 4215, 4, 66, 549000),
 (195, 2162, 4, 43, 287000),
 (198, 2567, 4, 57, 314000),
 (201, 1852, 4, 64, 299900),
 (205, 2390, 4, 34, 319000),
 (212, 3000, 4, 75, 539900),
 (213, 1985, 4, 61, 299900),
 (218, 1940, 4, 7, 239999),
 (223, 2300, 4, 77, 449900),
 (226, 2609, 4, 5, 499998),
 (227, 3031, 4, 21, 599000),
 (231, 1962, 4, 53, 259900),
 (240, 2040, 4, 75, 314900),
 (242, 1811, 4, 24, 285900),
 (245, 2132, 4, 28, 345000),
 (246, 4215, 4, 66, 549000),
 (247, 2162, 4, 43, 287000),
 (250, 2567, 4, 57, 314000),
 (253, 1852, 4, 64, 299900)]

**2. The following query calculates the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [14]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1804.0073529411766, 320467.57352941175),
 (4, 2399.864864864865, 374290.3378378378),
 (5, 4298.75, 669562.5)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [15]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [16]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('../../DATA/housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [17]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

47

Run a query to get the average price of each house size from this table:

In [18]:
#ANSWER
c.execute("Select sqft,AVG(price) FROM houses_pandas GROUP BY sqft ").fetchall()

[(852, 179900.0),
 (1000, 169900.0),
 (1100, 249900.0),
 (1200, 299000.0),
 (1203, 239500.0),
 (1236, 199900.0),
 (1239, 229900.0),
 (1268, 259900.0),
 (1320, 299900.0),
 (1380, 212000.0),
 (1416, 232000.0),
 (1427, 198999.0),
 (1437, 249900.0),
 (1458, 464500.0),
 (1494, 242500.0),
 (1534, 314900.0),
 (1600, 329900.0),
 (1604, 242900.0),
 (1664, 368500.0),
 (1767, 252900.0),
 (1811, 285900.0),
 (1839, 349900.0),
 (1852, 299900.0),
 (1888, 255000.0),
 (1890, 329999.0),
 (1940, 239999.0),
 (1962, 259900.0),
 (1985, 299900.0),
 (2000, 347000.0),
 (2040, 314900.0),
 (2104, 399900.0),
 (2132, 345000.0),
 (2162, 287000.0),
 (2200, 475000.0),
 (2238, 329900.0),
 (2300, 449900.0),
 (2400, 369000.0),
 (2526, 469000.0),
 (2567, 314000.0),
 (2609, 499998.0),
 (2637, 299900.0),
 (3000, 539900.0),
 (3031, 599000.0),
 (3137, 579900.0),
 (3890, 573900.0),
 (4215, 549000.0),
 (4478, 699900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate functions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [19]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [20]:
# Reading CSV to Dataframe
orders = pd.read_csv('../../DATA/P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('../../DATA/P12-OrderBreakdown.csv', encoding = 'utf-8')

In [21]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [22]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [23]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [24]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

#### 3. Check DataTypes

In [25]:
# ANSWER
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [26]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales           float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [27]:
# Establishing Local DB connection
db_connection = sqlite3.connect('../../DATA/eshop.db.sqlite')

# Save these two dataframes as a table in sqlite

#### 5. Select Number of Orders for Each Customer

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [28]:
# Select first 10 rows of all columns in orders table

query = """
        SELECT * 
        FROM orders 
        LIMIT 10;
        """

orders_head_10 = sql.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

In [29]:
# Select Number of Distinct Orders for Each Customer

query = """
        SELECT customer_name, Count(order_id) as number_of_orders
        
        FROM orders
        GROUP BY customer_name;
        """
sql.read_sql(query,con=db_connection)

          customer_name  number_of_orders
0         Aaron Bergman                11
1         Aaron Hawkins                 7
2        Aaron Smayling                12
3       Adam Bellavance                 4
4             Adam Hart                 8
..                  ...               ...
787        Xylona Preis                 2
788       Yana Sorensen                 5
789      Yoseph Carroll                11
790    Zuschuss Carroll                 9
791  Zuschuss Donatelli                 6

[792 rows x 2 columns]

#### 6. Select Number of Customers for Each Country

In [30]:
# Select Number of Customers for Each Country
query = """
        SELECT country, count(customer_name) as number_of_customers
        FROM orders
        GROUP BY country;
        """
sql.read_sql(query,con=db_connection)

           country  number_of_customers
0          Austria                  135
1          Belgium                   68
2          Denmark                   29
3          Finland                   34
4           France                  991
5          Germany                  806
6          Ireland                   50
7            Italy                  493
8      Netherlands                  194
9           Norway                   37
10        Portugal                   37
11           Spain                  403
12          Sweden                  100
13     Switzerland                   40
14  United Kingdom                  700

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [31]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table

query = """
        SELECT order_id, discount, sales, quantity 
        FROM orders_break_down;
        """

sql.read_sql(query,con=db_connection)

             order_id  discount  sales  quantity
0     IT-2011-3647632       0.5   45.0         3
1     ES-2011-4869686       0.0  854.0         7
2     ES-2011-4939443       0.0  140.0         3
3     IT-2011-2942451       0.5   27.0         2
4     IT-2011-2942451       0.5   17.0         2
...               ...       ...    ...       ...
8042  ES-2014-3458802       0.0  245.0         2
8043  IT-2014-3715679       0.5   30.0         2
8044  IT-2014-3715679       0.5   23.0         4
8045  IT-2014-3715679       0.5  108.0         3
8046  ES-2014-3458802       0.0  867.0         5

[8047 rows x 4 columns]

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [58]:
# Select discount, sales, quantity, total price for Each Order Id from orders_break_down Table

query = """
        SELECT order_id, discount,sales, quantity,  (sales * quantity - discount) as total_price
        
        FROM orders_break_down
        ORDER BY total_price DESC;
        """

sql.read_sql(query,con=db_connection)

             order_id  discount   sales  quantity  total_price
0     ES-2014-3785216       0.1  5729.0        14      80205.9
1     ES-2011-3248922       0.0  6517.0        12      78204.0
2     ES-2012-2183106       0.1  4748.0        14      66471.9
3     IT-2013-4602742       0.1  5726.0        10      57259.9
4     ES-2014-2637201       0.0  4141.0        13      53833.0
...               ...       ...     ...       ...          ...
8042  IT-2013-5843979       0.5     5.0         1          4.5
8043  ES-2013-3706388       0.0     4.0         1          4.0
8044  IT-2011-1320928       0.5     4.0         1          3.5
8045  IT-2014-3944375       0.5     4.0         1          3.5
8046  IT-2012-2013268       0.5     3.0         1          2.5

[8047 rows x 5 columns]

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [56]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100

query = """
        SELECT order_id, (sales * quantity - discount) AS total_price
        FROM orders_break_down
        WHERE total_price>100 
        ORDER BY total_price ASC;
        """

sql.read_sql(query,con=db_connection)

             order_id  total_price
0     IT-2011-2668777        101.5
1     IT-2011-1165265        101.5
2     ES-2012-1763830        101.5
3     IT-2012-4099397        101.5
4     ES-2013-4250046        101.5
...               ...          ...
6461  ES-2014-2637201      53833.0
6462  IT-2013-4602742      57259.9
6463  ES-2012-2183106      66471.9
6464  ES-2011-3248922      78204.0
6465  ES-2014-3785216      80205.9

[6466 rows x 2 columns]

#### 8. Select All Customers And The Products They Have Bought

In [34]:
# Select All Order Ids, Customers And The Products (product_name) They Have Bought

query = """
        SELECT orders.order_id, orders.customer_name, orders_break_down.product_name
        FROM orders 
        JOIN orders_break_down ON orders.order_id=orders_break_down.order_id 
        """

sql.read_sql(query,con=db_connection)

,order_id,customer_name,product_name
0,IT-2011-3647632,Eugene Moren,"Enermax Note Cards, Premium"
1,ES-2011-4869686,Dorothy Dickinson,"Dania Corner Shelving, Traditional"
2,ES-2011-4939443,Arthur Prichep,"Binney & Smith Sketch Pad, Easy-Erase"
3,IT-2011-2942451,Grant Thornton,"Boston Markers, Easy-Erase"
4,IT-2011-2942451,Grant Thornton,"Eldon Folders, Single Width"
...,...,...,...
8042,ES-2014-3638865,Susan Vittorini,"Fellowes Shelving, Single Width"
8043,ES-2014-4785777,Dennis Pardue,"Wilson Jones Index Tab, Economy"
8044,IT-2014-3715679,Jim Kriz,"Avery Binder Covers, Recycled"
8045,IT-2014-3715679,Jim Kriz,"BIC Pencil Sharpener, Fluorescent"
8046,IT-2014-3715679,Jim Kriz,"StarTech Phone, Red"

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [35]:
# Select Number of 'Furniture' Orders For Each Country

query = """
        SELECT orders.country, count(orders_break_down.category) as number_of_furniture
        FROM orders
        JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
        WHERE orders_break_down.category = 'Furniture'
        GROUP BY orders.country;
        """

sql.read_sql(query,con=db_connection)

           country  number_of_furniture
0          Austria                   40
1          Belgium                   20
2          Denmark                    9
3          Finland                   16
4           France                  299
5          Germany                  264
6          Ireland                   12
7            Italy                  136
8      Netherlands                   76
9           Norway                    6
10        Portugal                   10
11           Spain                  123
12          Sweden                   36
13     Switzerland                   11
14  United Kingdom                  180

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [54]:
# Select Number of 'Furniture' Orders For The Country Denmark

query = """
        SELECT *
        FROM orders
        JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
        WHERE orders_break_down.category = 'Furniture' AND orders.country = "Denmark"
        
        """
sql.read_sql(query,con=db_connection)

,order_id,order_date,customer_name,country,order_id,product_name,discount,sales,quantity,category
0,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,ES-2011-1586186,"Office Star Bag Chairs, Set of Two",0.5,87.0,3,Furniture
1,IT-2012-4084224,2012-02-15,Mick Brown,Denmark,IT-2012-4084224,"Rubbermaid Door Stop, Ergonomic",0.6,17.0,1,Furniture
2,IT-2013-4649004,2013-05-31,Bart Folk,Denmark,IT-2013-4649004,"Novimex Executive Leather Armchair, Red",0.5,920.0,4,Furniture
3,ES-2013-3422294,2013-09-07,Dave Brooks,Denmark,ES-2013-3422294,"Advantus Door Stop, Duo Pack",0.6,36.0,2,Furniture
4,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Deflect-O Clock, Black",0.6,161.0,8,Furniture
5,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Harbour Creations Bag Chairs, Set of Two",0.5,32.0,1,Furniture
6,ES-2014-1415600,2014-07-07,Damala Kotsonis,Denmark,ES-2014-1415600,"Deflect-O Door Stop, Duo Pack",0.6,70.0,4,Furniture
7,IT-2014-1978058,2014-11-13,Anthony Jacobs,Denmark,IT-2014-1978058,"Harbour Creations Steel Folding Chair, Red",0.5,98.0,2,Furniture
8,ES-2014-5784412,2014-11-25,Pete Kriz,Denmark,ES-2014-5784412,"Eldon Light Bulb, Black",0.6,50.0,5,Furniture

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [52]:
# Select Total Sales With Discount (discount > 0) and Without Discount (discount = 0) for Each Country



sql_string = '''
    SELECT
        orders.country
        , SUM(CASE WHEN discount == 0 THEN sales ELSE 0 END) AS non_discount_sales
        , SUM(CASE WHEN discount > 0 THEN sales ELSE 0 END) AS discount_sales       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

   country  non_discount_sales  discount_sales
0  Austria             79382.0             0.0
1  Belgium             42320.0             0.0
2  Denmark                 0.0          7763.0
3  Finland             20702.0             0.0
4   France            129791.0        479892.0

#### 11.A Select Total Quantity, Total Sales for Each Country

In [51]:
# Select Total Quantity, Total Sales for Each Country

sql_string = '''
    SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

   country  total_sales  total_quantity
0  Austria      79382.0             973
1  Belgium      42320.0             532
2  Denmark       7763.0             204
3  Finland      20702.0             201
4   France     609683.0            7329

#### 11.B Select Top 3 Countries and Quantities Based on Total Sales

In [50]:
# Select Top 3 Countries and Quantities Based on Total Sales

query = """
        SELECT orders.country, sum(orders_break_down.quantity) as quantities, SUM( orders_break_down.sales) AS total_sales
        
        FROM orders
        JOIN orders_break_down ON orders.order_id=orders_break_down.order_id 
        
        GROUP BY orders.country
        ORDER BY total_sales DESC
        LIMIT 3;
        """


sql.read_sql(query,con=db_connection)

          country  quantities  total_sales
0          France        7329     609683.0
1         Germany        6179     488681.0
2  United Kingdom        4917     420497.0

#### 11.C Select Bottom 3 Countries and Sales Based On Total Quantities

In [40]:
# Select Bottom 3 Countries and Sales Based On Total Quantities

query = """
        SELECT orders.country, sum(orders_break_down.sales) as sales, sum(orders_break_down.quantity) as quantities
        
        FROM orders
        JOIN orders_break_down ON orders.order_id=orders_break_down.order_id 
        
        GROUP BY orders.country
        ORDER BY quantities ASC
        LIMIT 3;
        """


sql.read_sql(query,con=db_connection)

   country    sales  quantities
0  Finland  20702.0         201
1  Denmark   7763.0         204
2   Norway  20529.0         261

#### 12. Select Average Sales By Category For The Country 'France'

In [49]:
# Select Average Sales By Category For The Country 'France'


query = """
        SELECT orders.country, orders_break_down.category, AVG(orders_break_down.sales) AS average_sales
        FROM orders
        JOIN orders_break_down ON orders.order_id=orders_break_down.order_id 
        WHERE orders.country ="France"
        GROUP BY orders.country, orders_break_down.category
        ORDER BY average_sales 
        ;
        """


sql.read_sql(query,con=db_connection)

  country         category  average_sales
0  France  Office Supplies     167.217709
1  France        Furniture     582.314381
2  France       Technology     595.145078

#### 13. Select Country, Category and Average Sales Where Average Sales is The Highest

In [47]:
# Select Country, Category and Average Sales Where Average Sales is The Highest

query = """
        SELECT orders.country, orders_break_down.category, AVG(orders_break_down.sales) AS avg_sales
        FROM orders
        JOIN orders_break_down ON orders.order_id=orders_break_down.order_id 
        GROUP BY orders.country, orders_break_down.category
        ORDER BY avg_sales Desc
        Limit 1
        ;
        """


sql.read_sql(query,con=db_connection)

       country    category   avg_sales
0  Switzerland  Technology  902.846154

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax



---



---



> > > > > > > > >  2022 Institute of Data


---



---